<a href="https://colab.research.google.com/github/amina765/My_doc/blob/main/Spark_day2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

importing pyspark

In [ ]:
from pyspark.sql import SparkSession
spark=(
    SparkSession.builder.appName("SparkIntroduction").getOrCreate()
)
spark

creating table

In [ ]:
emp_data = [
    ["001","101","john doe","30","male","50000","2015-01-01"],
    ["002","102","jani smith","25","female","45000","2016-02-15"],
    ["003","103","boby","35","male","55000","2014-05-01"],
    ["004","104","ancy","28","female","60000","2010-07-08"],
    ["005","105","aleena","37","female","57000","2018-08-01"],
    ["006","106","johnny","27","male","70000","2016-04-07"]
]

creating the column name

In [ ]:
columns="employee_id string,department_id string,employee_name string,age string,gender string,salary string,hire_date string"

clubing the column means creating a tabluar form using dataframe

In [ ]:
emp=spark.createDataFrame(data=emp_data,schema=columns)
emp.show()

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|employee_name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        001|          101|     john doe| 30|  male| 50000|2015-01-01|
|        002|          102|   jani smith| 25|female| 45000|2016-02-15|
|        003|          103|         boby| 35|  male| 55000|2014-05-01|
|        004|          104|         ancy| 28|female| 60000|2010-07-08|
|        005|          105|       aleena| 37|female| 57000|2018-08-01|
|        006|          106|       johnny| 27|  male| 70000|2016-04-07|
+-----------+-------------+-------------+---+------+------+----------+

data description

In [ ]:
emp.printSchema()

root
 |-- employee_id: string (nullable = true)
 |-- department_id: string (nullable = true)
 |-- employee_name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- hire_date: string (nullable = true)

define the schema

In [ ]:
from pyspark.sql.types import StructType,StructField,StringType,IntegerType

for creating nullable value

In [ ]:
schema=StructType([
    StructField("name",StringType(),nullable=False),
    StructField("age",StringType(),nullable=False),
    StructField("city",StringType(),nullable=False)
])

creating another table for to show changing the nullable value

In [ ]:
data = [("Alice",25,"New York"),("Bob",30,"San Francisco"),("Charlie",35,"Los Angeles")]

creating the dataframe for above table

In [ ]:
data_datas = spark.createDataFrame(data,schema)
data_datas.show()

+-------+---+-------------+
|   name|age|         city|
+-------+---+-------------+
|  Alice| 25|     New York|
|    Bob| 30|San Francisco|
|Charlie| 35|  Los Angeles|
+-------+---+-------------+

then here we can see the change of nullable value

In [ ]:
data_datas.printSchema()

root
 |-- name: string (nullable = false)
 |-- age: string (nullable = false)
 |-- city: string (nullable = false)

to see the first 3 col in table

In [ ]:
emp.show(3)

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|employee_name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        001|          101|     john doe| 30|  male| 50000|2015-01-01|
|        002|          102|   jani smith| 25|female| 45000|2016-02-15|
|        003|          103|         boby| 35|  male| 55000|2014-05-01|
+-----------+-------------+-------------+---+------+------+----------+
only showing top 3 rows

to show the name and age of first 5 table

In [ ]:
emp.select("employee_name","age").show(5)

+-------------+---+
|employee_name|age|
+-------------+---+
|     john doe| 30|
|   jani smith| 25|
|         boby| 35|
|         ancy| 28|
|       aleena| 37|
+-------------+---+
only showing top 5 rows

for filtering the data by using condition

In [ ]:
emp.filter(emp.age>30).show()

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|employee_name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        003|          103|         boby| 35|  male| 55000|2014-05-01|
|        005|          105|       aleena| 37|female| 57000|2018-08-01|
+-----------+-------------+-------------+---+------+------+----------+

to get the descending value

In [ ]:
emp.orderBy(emp.salary.desc()).show()

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|employee_name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        006|          106|       johnny| 27|  male| 70000|2016-04-07|
|        004|          104|         ancy| 28|female| 60000|2010-07-08|
|        005|          105|       aleena| 37|female| 57000|2018-08-01|
|        003|          103|         boby| 35|  male| 55000|2014-05-01|
|        001|          101|     john doe| 30|  male| 50000|2015-01-01|
|        002|          102|   jani smith| 25|female| 45000|2016-02-15|
+-----------+-------------+-------------+---+------+------+----------+

to get ascending value

In [ ]:
emp.orderBy(emp.salary.asc()).show()

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|employee_name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        002|          102|   jani smith| 25|female| 45000|2016-02-15|
|        001|          101|     john doe| 30|  male| 50000|2015-01-01|
|        003|          103|         boby| 35|  male| 55000|2014-05-01|
|        005|          105|       aleena| 37|female| 57000|2018-08-01|
|        004|          104|         ancy| 28|female| 60000|2010-07-08|
|        006|          106|       johnny| 27|  male| 70000|2016-04-07|
+-----------+-------------+-------------+---+------+------+----------+